# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример: - 45 -> 101101 ;  3 -> 11 ; 2 -> 10
i = int(input('Введите десятичное число: '))

print(f'Десятичное число {i} = двоичному числу {bin(i)}')